# language: ru
@TestOne
Функция: Первый тест
    @correct
        Сценарий: успешное выполнение первого теста
        Дупустим открыть яндекс и провести манипуляции
        Если перейти в маркет
        И выбрать раздел электроники
        И выбрать раздел телевизоры
        И зайти в расширенный поиск
        И задать параметры поиска от 20000 рублей
        И выбрать производителей от Самсунг и ЭлДжи
        И нажать кнопку применить
        И проверить что элементов 12 штук
        И запомнить первый
        И в поисковую строку ввести заполненное значение       
        То наименование товара соответсвуют запомненному значению
